In [1]:
# 2022/03/04

import pandas as pd

In [2]:
sales_df = pd.read_csv("./pandas/Sales Records.csv")
sales_df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,1/27/2011,292494523,2/12/2011,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Europe,Latvia,Beverages,Online,C,12/28/2015,361825549,1/23/2016,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Middle East and North Africa,Pakistan,Vegetables,Offline,C,1/13/2011,141515767,2/1/2011,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Sub-Saharan Africa,Democratic Republic of the Congo,Household,Online,C,9/11/2012,500364005,10/6/2012,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Europe,Czech Republic,Beverages,Online,C,10/27/2015,127481591,12/5/2015,3491,47.45,31.79,165647.95,110978.89,54669.06
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,Asia,Laos,Beverages,Online,H,7/15/2014,199342048,7/31/2014,8597,47.45,31.79,407927.65,273298.63,134629.02
9996,Europe,Liechtenstein,Cosmetics,Online,C,10/27/2012,763044106,11/1/2012,562,437.20,263.33,245706.40,147991.46,97714.94
9997,Sub-Saharan Africa,Democratic Republic of the Congo,Vegetables,Offline,M,2/14/2013,848579967,3/20/2013,2524,154.06,90.93,388847.44,229507.32,159340.12
9998,Sub-Saharan Africa,South Africa,Meat,Online,L,2/19/2017,298185956,2/22/2017,8706,421.89,364.69,3672974.34,3174991.14,497983.20
9999,Asia,Mongolia,Snacks,Offline,M,4/12/2016,824410903,4/16/2016,361,152.58,97.44,55081.38,35175.84,19905.54

In [3]:
### 해야 될 것 ###

# 1. 컬럼 삭제(ship date, order id, sales channel, Total Revenue) >> 원본데이터 유지 (새로운 변수 필요)

# 2. 컬럼명 수정 >> 원본데이터 유지 불필요 (새로운 변수 불필요)

# 3. Country 기준으로 Sort

# 4. index 값을 초기화

# Web >> sales_records_web >> ex_main.ipynb에서 계속...

In [4]:
import datetime

In [5]:
format = "%Y-%m-%d %H:%M:%S"

time_str = "2022-03-04 13:01:30"

type(time_str)

str

In [6]:
# strptime : 문자열로부터 날짜와 시간 정보를 읽어서 datetime.datetime 클래스 객체를 만듬

time_datetime = datetime.datetime.strptime(time_str, format)
time_datetime

datetime.datetime(2022, 3, 4, 13, 1, 30)

In [7]:
type(time_datetime)

datetime.datetime

In [8]:
datetime.datetime.today()

datetime.datetime(2022, 3, 7, 9, 23, 56, 452978)

In [9]:
print(datetime.date.today())

print(datetime.datetime.today())

2022-03-07
2022-03-07 09:23:56.472145

In [10]:
# strftime : 날짜와 시간 정보를 문자열로 바꿔주는 함수

time_str_2 = time_datetime.strftime(format)
print(time_str_2)
print(type(time_str_2))

2022-03-04 13:01:30
<class 'str'>

In [11]:
import pandas as pd

In [12]:
# 1970-01-01 기준

# unit = 'D' : 날짜를 더 해줌

pd.Timestamp(1, unit='D')

Timestamp('1970-01-02 00:00:00')

In [13]:
pd.Timestamp('2022-03-04')

Timestamp('2022-03-04 00:00:00')

In [14]:
pd.Timestamp('2022-03')

Timestamp('2022-03-01 00:00:00')

In [15]:
pd.to_datetime('2022-03-04 10:24:30')

Timestamp('2022-03-04 10:24:30')

In [16]:
# freq='W' : 일요일 기준으로 출력
# freq='W-MON' : 월요일 기준으로 출력
# freq='D' : 일 기준으로 출력
# freq='M' : 월 기준으로 출력
# freq='Y' : 연 기준으로 출력

pd.date_range('2022-01-01', '2022-03-04', freq='W')

DatetimeIndex(['2022-01-02', '2022-01-09', '2022-01-16', '2022-01-23',
               '2022-01-30', '2022-02-06', '2022-02-13', '2022-02-20',
               '2022-02-27'],
              dtype='datetime64[ns]', freq='W-SUN')

In [17]:
# Period : 입력된 값과 형태를 나타냄

pd.Period('2022-03-04')

Period('2022-03-04', 'D')

In [18]:
pd.period_range('2000-01-01','2022-03-04', freq='M')

PeriodIndex(['2000-01', '2000-02', '2000-03', '2000-04', '2000-05', '2000-06',
             '2000-07', '2000-08', '2000-09', '2000-10',
             ...
             '2021-06', '2021-07', '2021-08', '2021-09', '2021-10', '2021-11',
             '2021-12', '2022-01', '2022-02', '2022-03'],
            dtype='period[M]', length=267)

In [19]:
p = pd.Period('2022-03-04')
print(p.start_time)
print(p.end_time)

2022-03-04 00:00:00
2022-03-04 23:59:59.999999999

In [20]:
# Timedelta 시간에 대한 연산을 할 때 사용

pd.Timedelta('1 days')

Timedelta('1 days 00:00:00')

In [21]:
print(pd.Timedelta('1 days'))
print(pd.Timedelta('1 days 2 hours'))
print(pd.Timedelta('-2 days 3min 3ns'))

1 days 00:00:00
1 days 02:00:00
-3 days +23:56:59.999999997

In [22]:
pd.Timestamp('1992-10-24') + pd.Timedelta('2days')

Timestamp('1992-10-26 00:00:00')

In [23]:
import numpy as np

s1 = pd.Series([1, np.nan, 3, 4, 5])
s2 = pd.Series([1, 2, np.nan, 4, 5])
s3 = pd.Series([1, 2, 3, np.nan, 5])
df = pd.DataFrame({'s1' : s1,
                    's2' : s2,
                    's3' : s3})

df

    s1   s2   s3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [24]:
# isna() : 결측치 확인
# isna().sum() : 결측치 개수 확인

df.isna()

df['s1'].isna()

0    False
1     True
2    False
3    False
4    False
Name: s1, dtype: bool

In [25]:
True == 0

False

In [26]:
False == 0

True

In [27]:
# axis = 0 = 'rows'
# axis = 1 = 'columns'

df.dropna(axis=0)

    s1   s2   s3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [28]:
# 칼럼 값에 일괄되게 더할 수 있다

df['s1'] = df['s1'] + 1

df

    s1   s2   s3
0  2.0  1.0  1.0
1  NaN  2.0  2.0
2  4.0  NaN  3.0
3  5.0  4.0  NaN
4  6.0  5.0  5.0

In [29]:
_list = [5,4,3,2,1]

df['s2'] = df['s2'] + _list

df

    s1   s2   s3
0  2.0  6.0  1.0
1  NaN  6.0  2.0
2  4.0  NaN  3.0
3  5.0  6.0  NaN
4  6.0  6.0  5.0

In [30]:
_tuple = (1,2,3,4,5)

df['s3'] = df['s3'] + _tuple

df

    s1   s2    s3
0  2.0  6.0   2.0
1  NaN  6.0   4.0
2  4.0  NaN   6.0
3  5.0  6.0   NaN
4  6.0  6.0  10.0

In [31]:
_list_2 = ([2,1,2],[3,4,5],[1,2,3])

dot_result = df @ _list_2

dot_result

      0     1     2
0  24.0  30.0  40.0
1   NaN   NaN   NaN
2   NaN   NaN   NaN
3   NaN   NaN   NaN
4  40.0  50.0  72.0

In [32]:
# 데이터 프레임을 행렬곱을 하기 위해서는 첫번째 행렬의 열(columns)과 두번째 행렬의 행(index)의 숫자가 명칭이 동일하여야 한다.(??)

s1 = pd.Series([1,2,3])
s2 = pd.Series([4,5,6])
s3 = pd.Series([7,8,9])

df_2 = pd.DataFrame({'s1':s1,
                        's2':s2,
                        's3':s3})

df_2.index = df.columns

df_2

    s1  s2  s3
s1   1   4   7
s2   2   5   8
s3   3   6   9

In [33]:
df @ df_2

     s1     s2     s3
0  20.0   50.0   80.0
1   NaN    NaN    NaN
2   NaN    NaN    NaN
3   NaN    NaN    NaN
4  48.0  114.0  180.0

In [34]:
df.to_numpy()

array([[ 2.,  6.,  2.],
       [nan,  6.,  4.],
       [ 4., nan,  6.],
       [ 5.,  6., nan],
       [ 6.,  6., 10.]])

In [35]:
df.to_numpy().dot(df_2.to_numpy())

array([[ 20.,  50.,  80.],
       [ nan,  nan,  nan],
       [ nan,  nan,  nan],
       [ nan,  nan,  nan],
       [ 48., 114., 180.]])